# أختيار أسم المتغير مهم جدا وبسمي الأسم علي حسب القيمة التي ياخذها
# لايمكن إنشاء متغير يبدأ با أرقام , لكن يمكن أضافة هذه الأرقام في منتصف الكلمة أو في النهاية
#مسافة قبل المتغير  space لا يمكن اضافة 
# لو المتغير مكون من أسمين بستخدم _ تمام
student_name = 'Khaled'
#دي كلمات محجوزة لغة بايثون (if - or - and ...)لا يمكن استخدام كلمات مثلا 
#في المتغيرات data types يمكن تخزين اي نوع 
age = 20
name = 'Ahmed'

#function type  تم تخزين داخل  data متغير اسمه 
data = type(age)

# small , capital انتباه في الحروف 
num = 123.5
print(num)
Num = 124
print(Num)

word = 'Egypt'
word = 'Deutschland'
#يطبع اخر قيمة في المتغير 
print(word)





